---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisResultSchema)
source: html/14bb2b10-9d3f-c701-de4a-bdb06d2e1f69.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.IsEqual Method

Determines if the input object is equivalent to this AnalysisResultSchema.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisResultSchema other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisResultSchema`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null